Finn-Land/IoTCourseMP/Teamfolder/Group1/exercises/exercise03/ESP32 to MQTT (DHT22)/src/main.cpp
#include "ESP32_Impl.h"

ESP32_Imp esp32;

// Wifi settings
char *SSID = "iotempire-magnusperfectus";
char *PWD = "iotempire";

// MQTT settings
char *mqttServer = "192.168.12.1";
int mqttPort = 1883;

// Timing variables
long curTime;
long prevTime;

static void mqttCallback(char *topic, byte *message, unsigned int length);

void setup()
{
  Serial.begin(115200);
  esp32.connect(SSID, PWD);
  esp32.setupMQTT(mqttServer, mqttPort);
  esp32.mqttClient.setCallback(mqttCallback);
  esp32.dht.begin();
}

static void mqttCallback(char *topic, byte *message, unsigned int length)
{
  Serial.print("Message arrived on topic: ");
  Serial.print(topic);
  Serial.println("Message: ");

  // Don't need this since we are always expecting JSON?
  for (int i = 0; i < length; i++)
  {
    Serial.print((char)message[i]);
  }
  Serial.println();
}

void loop()
{
  if (!esp32.mqttClient.connected())
  {
    esp32.reconnect();
  }
  esp32.mqttClient.loop();

  // Non-Blocking delay to publish to MQTT
  curTime = millis();
  if (curTime - prevTime > 2000)
  {
    esp32.readAndSendData("magnusp/DHTtemp");
    prevTime = curTime;
  }
}
